/*********************************************************************************************
 *   __      __   _         _________     _ _     _    _________   __         _         __   *
 *	 \ \    / /  | |        | _______|   | | \   | |  |  ______ |  \ \       / \       / /   *
 *	  \ \  / /   | |        | |          | |\ \  | |  | |     | |   \ \     / \ \     / /    *
 *     \ \/ /    | |        | |______    | | \ \ | |  | |     | |    \ \   / / \ \   / /     *
 *     /\/\/\    | |        |_______ |   | |  \ \| |  | |     | |     \ \ / /   \ \ / /      *
 *    / /  \ \   | |______   ______| |   | |   \ \ |  | |_____| |      \ \ /     \ \ /       *
 *   /_/    \_\  |________| |________|   |_|    \__|  |_________|       \_/       \_/        *
 *                                                                                           *
 *********************************************************************************************/
#import <Foundation/Foundation.h>
#import <UIKit/UIKit.h>

@interface XLsn0wDrawQRCoder : NSObject

/**
 绘制二维码

 @param URLString url链接
 @param width 二维码所显示imageView的宽度（即高度）正方形
 @return 二维码图片视图
 */
+ (UIImage *)drawQRCodeWithURLString:(NSString *)URLString imageView_frame_size_width:(CGFloat)width;

@end
